## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.locust is tainted, so must be replaced
-/+ resource "argocd_application" "locust" {
!       id      = "locus" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "locus"
!           resource_version = "3447971" -> (known after apply)
!           uid              = "3c74ccc6-efde-424f-a884-149ed8103ad7" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # kubernetes_namespace.loadtesting must be replaced
-/+ resource "kubernetes_namespace" "loadtesting" {
!       id = "cinema" -> (known after apply)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
!           name             = "cinema" -> "loadtesting" # forces replacement
!           resource_version = "13845" -> (known after apply)
!           uid              = "84fcd379-a682-4ee9-9abb-c6b902158f74" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-gqf8t" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
